3_urban/2_workflow/models/openfoam/0.orig/AoA
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0";
    object AoA;
}
dimensions  [0 0 1 0 0 0 0];
internalField uniform 0;
boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    merged_domain_ground
    {
        type zeroGradient;
    }

    merged_inlet
    {
        type zeroGradient;
    }

    merged_outlet
    {
        type zeroGradient;
    }

    merged_domain
    {
        type            fixedValue;
        value           uniform 0;
    }

    merged_water
    {
       type zeroGradient;
    }

    merged_ground
    {
        type zeroGradient;
    }

    merged_building3
    {
        type zeroGradient;
    }

    merged_building2
    {
        type zeroGradient;
    }

    merged_building1
    {
        type zeroGradient;
    }

}
