3_urban/2_workflow/models/openfoam/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    location "0";
    object U;
}

dimensions [ 0 1 -1 0 0 0 0 ];
internalField uniform (0.0 0.0 0.0);
boundaryField
{

    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    merged_domain_ground
    {
        type fixedValue;
        value uniform ( 0 0 0);
    }

    merged_inlet
    {
        type surfaceNormalFixedValue;
        value uniform ( 0.0 0.0 0.0 );
        refValue uniform -3.5;
    }

    merged_outlet
    {
        type inletOutlet;
        value uniform ( 0.0 0.0 0.0 );
        inletValue uniform ( 0.0 0.0 0.0 );
    }

    merged_domain
    {
        type slip;
    }

    merged_water
    {
        type fixedValue;
        value uniform ( 0 0 0);
    }

    merged_ground
    {
        type fixedValue;
        value uniform ( 0 0 0);
    }

    merged_building3
    {
        type fixedValue;
        value uniform ( 0 0 0);
    }

    merged_building2
    {
        type fixedValue;
        value uniform ( 0 0 0);
    }

    merged_building1
    {
        type fixedValue;
        value uniform ( 0 0 0);
    }

}
